[
    {
        "title": "GREON Website",
        "fname": "greon",
        "desc": "Worked alongside teammates to build a system to provide NGRREC easy access to live data collected from their various GREON units throughout the region, including a frontend website, a large database, and a backdoor interface for authorized employees.",
        "img": "/greon.png",
        "screenshot": "/greonScreenshot.png",
        "github": null,
        "link": "https://greon.ngrrec.org/"
    },
    {
        "title": "Genomics AI Project",
        "fname": "tcell",
        "desc": "With guidance from Dr. Manas Das, and alongside Zach Linscott, I utilized convolutional neural networks to locate accessible regions in T-cells and lymphoblast cells in human blood given a sequence of DNA. Our project was included in SIUE's Spring 2024 Undergraduate Showcase.",
        "img": "/tcell.png",
        "screenshot": "/tcellScreenshot.PNG",
        "github": null,
        "link": "/TCell_Lymphoblast_Accessibility.pdf",
        "linkLabel": "See the Poster"
    },
    {
        "title": "Turtle Race",
        "fname": "turtlerace",
        "desc": "Full-stack web app where users vote on the winning turtle in a series of races. It uses Google user authentication and a REST API to connect the PostgreSQL database to a Next.js frontend",
        "img": "/turtleRace.png",
        "screenshot": "/defaultProjectScreenshot.png",
        "github": "https://github.com/cbayles1/turtleRace",
        "link": "https://turtle-race.vercel.app/",
        "linkLabel": "Live Site"
    },
    {
        "title": "Expendable 054",
        "fname": "expendable054",
        "desc": "Made with the help of some artistic friends, this game was simultaneously the most enjoyable to make, and also the reason I decided to abandon making videogames with Python's pygame library! Development took longer than I expected, but I think it paid off in the end!",
        "img": "/expendable.png",
        "screenshot": "/expendableScreenshot.png",
        "github": "https://github.com/cbayles1/Expendable-054",
        "link": "https://caleb-bayles.itch.io/expendable054",
        "linkLabel": "Play Now!"
    },
    {
        "title": "Weather App",
        "fname": "weather",
        "desc": "A simple app that utilizes OpenWeather's One Call and Geolocation APIs in order to show the user both the current weather in their area of choice and a forecast. This project had the dual objectives of giving me hands-on experience with the React and Next.js ecosystem, as well as experience making API calls.",
        "img": "/weather.png",
        "screenshot": "/weatherScreenshot.PNG",
        "github": "https://github.com/cbayles1/weather",
        "link": "https://weather-cbayles1.vercel.app/",
        "linkLabel": "Get your Weather Now!"
    },
    {
        "title": "Backing Track",
        "fname": "backingTrack",
        "desc": "This project was an attempt to incorporate a hobby of mine, songwriting and musicianship with computing. The goal was to turn chord names given as input into MIDI chords as output to make creation of backing tracks easier on the musician. I had to abandon a mathematically challenging section of the project because I simply couldn't figure it out, but I might return to it at some point.",
        "img": "/backingTrack.png",
        "screenshot": "/backingTrackScreenshot.PNG",
        "github": "https://github.com/cbayles1/chordsToMidi",
        "link": null
    },
    {
        "title": "This Portfolio",
        "fname": "portfolio",
        "desc": "This portfolio was my continuation of practicing React and Next.js in a more practical way after the weather app. I also used this as an opportunity to learn Tailwind CSS, which is used instead of basic CSS throughout the entire site.",
        "img": "/portfolio.png",
        "screenshot": "/portfolioScreenshot.PNG",
        "github": "https://github.com/cbayles1/portfolio"
    },
    {
        "title": "Crazy Ice",
        "fname": "crazyice",
        "desc": "One of the earlier videogames I made, which offered the user a simple gameplay experience and a lot of custom options in the pause menu, both a choice of avatar color palette and of music.",
        "img": "/crazyIce.png",
        "screenshot": "/crazyIceScreenshoty.png",
        "github": "https://github.com/cbayles1/crazyIce"
    },
    {
        "title": "Spreadsheet to Response",
        "fname": "spreadsheetresponse",
        "desc": "Made for a teacher in my family who needed to speed up their grading process, this was my first project specifically made for someone else's use, and it was very gratifying to be able to see the fruit of my labor in action.",
        "img": "/spreadsheetresponse.png",
        "screenshot": "/spreadsheetresponseScreenshot.png",
        "github": "https://github.com/cbayles1/spreadsheettoresponse",
        "link": null
    },
    {
        "title": "BeachBot",
        "fname": "beachbot",
        "desc": "A now inactive Node.js Discord bot from my high school days which gave users custom nicknames and had other related functions. The code itself makes it apparent I had not yet learned the point of making efficient, non-redundant, clean code, but lessons have been learned since then!",
        "img": "/beachbot.png",
        "screenshot": "/beachbotScreenshot.png",
        "github": "https://github.com/cbayles1/beachbot",
        "link": null
    },
    {
        "title": "Task Calendar",
        "fname": "taskcalendar",
        "desc": "A simple planner I designed because I had a very specific way of event planning. (It also gave me some good practice with CSV manipulation.) It can add or delete tasks, view all planned tasks, and do so sorted by date. I still use it to this day!",
        "img": "/taskCalendar.png",
        "screenshot": "/taskCalendarScreenshot.png",
        "github": "https://github.com/cbayles1/taskcalendar",
        "link": null
    }
]